/*globel console, document, window, alert, prompt, confirm */

/*document.cookie("name=value; expires=date;path=")
 *
 * expires اللى هو تاريخ انتها الكوكاز و بعدين لو انت مكتبتهاش هى هتفضال لحين انت تقفال الواندو اللى انت فتحها و بعدين تنتهى
 *
 * path اللى هو عاوز الاعدادات تكون فى جميع الصفحات ولا الصفحة اللى انت فيه بس و لو مخترتش حاجة هى بتعملها فى الصفحة اللى انت فيه بس
 *
 * cookies
 *
 * فكرة عامل الكوكاز انو هى بتحفاظ الاعدادات اللى انت اخترتها فى الصفحة فى جهازك
 *
 * الكوكاز بتعتامد على التاريخ علشان تنتهى و راجع التاريخ اللى فى الجافا اسكربت
 *
 * */
console.log(document.cookie);
